In [1]:
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
from sklearn.ensemble import RandomForestClassifier
import pandas as pd
import matplotlib.pyplot as plt  
import numpy as np
from sklearn.model_selection import train_test_split

In [2]:
data=pd.read_csv('C:/Users/NAMRATA/Downloads/DATA SCIENCE/ASSIGNMENT/Random forests/Fraud_check.csv')
data.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [4]:
data2=pd.get_dummies(data,columns=['Undergrad','Urban'],drop_first=True)
data2.head()

,Marital.Status,Taxable.Income,City.Population,Work.Experience,Undergrad_YES,Urban_YES
0,Single,68833,50047,10,0,1
1,Divorced,33700,134075,18,1,1
2,Married,36925,160205,30,0,1
3,Single,50190,193264,15,1,1
4,Married,81002,27533,28,0,0

In [5]:
data3=pd.get_dummies(data2,columns=['Marital.Status'])
data3.head()

,Taxable.Income,City.Population,Work.Experience,Undergrad_YES,Urban_YES,Marital.Status_Divorced,Marital.Status_Married,Marital.Status_Single
0,68833,50047,10,0,1,0,0,1
1,33700,134075,18,1,1,1,0,0
2,36925,160205,30,0,1,0,1,0
3,50190,193264,15,1,1,0,0,1
4,81002,27533,28,0,0,0,1,0

Here we are taking taxable income as dependent variable as we have to build model to know the person's tax income is in risky or good.so it is categorised by income<30000 as risky and income>30000 as good

In [6]:
data3["Taxable.Income"] = pd.cut(data3["Taxable.Income"], bins = [10002,30000,99620], labels = ["Risky", "Good"])
data3.head()

,Taxable.Income,City.Population,Work.Experience,Undergrad_YES,Urban_YES,Marital.Status_Divorced,Marital.Status_Married,Marital.Status_Single
0,Good,50047,10,0,1,0,0,1
1,Good,134075,18,1,1,1,0,0
2,Good,160205,30,0,1,0,1,0
3,Good,193264,15,1,1,0,0,1
4,Good,27533,28,0,0,0,1,0

In [7]:
data4=pd.get_dummies(data3,columns=['Taxable.Income'],drop_first=True)
data4.head()

,City.Population,Work.Experience,Undergrad_YES,Urban_YES,Marital.Status_Divorced,Marital.Status_Married,Marital.Status_Single,Taxable.Income_Good
0,50047,10,0,1,0,0,1,1
1,134075,18,1,1,1,0,0,1
2,160205,30,0,1,0,1,0,1
3,193264,15,1,1,0,0,1,1
4,27533,28,0,0,0,1,0,1

In [8]:
x=data4.iloc[:,0:7]
y=data4.iloc[:,7]

In [9]:
# Splitting data into training and testing data set
x_train, x_test,y_train,y_test = train_test_split(x,y, test_size=0.3,random_state=4)

In [10]:
print(x_train.shape,y_train.shape, x_test.shape,y_test.shape)

(420, 7) (420,) (180, 7) (180,)

Random Forest Model

In [11]:
model = RandomForestClassifier(n_estimators=100)

In [12]:
model.fit(x_train,y_train)

RandomForestClassifier()

In [13]:
preds = model.predict(x_test) # predicting on test data set 
pd.Series(preds).value_counts() # getting the count of each category

1    166
0     14
dtype: int64

In [14]:
pd.crosstab(y_test,preds)

col_0                 0    1
Taxable.Income_Good
0                     0   29
1                    14  137

In [15]:
# The accuracy of model predicting the person's income_taxation is Risky or Good is 76%

In [16]:
np.mean(preds==y_test)

0.7611111111111111